# GROUP 1 QUIZ

## Load and Inspect the Data

### Read the dataset into a Pandas DataFrame.

In [162]:
#import pandas 
import pandas as pd

#load the data
path=r"C:\Users\USER\OneDrive\Desktop\advanced data analytics\Groups 1 and 3\Groups 1 and 3\customer_transactions.xlsx"
df=pd.read_excel(path)
print(df)

      Customer_ID     Name   Age  Gender      Education_Level  \
0            1001    Alice  43.0    Male            Secondary
1            1002    David  66.0    Male              Diploma
2            1003      Bob  61.0    Male              Diploma
3            1004      Ian  37.0    Male            Secondary
4            1005    Grace  64.0  Female                  PhD
...           ...      ...   ...     ...                  ...
1495         2496      Ian  55.0    Male               Master
1496         2497      Eve  75.0    Male               Master
1497         2498      Bob  47.0    Male            Secondary
1498         2499    David  38.0    Male              Primary
1499         2500  Charlie  76.0    Male  No formal education

      Number_of_Children     City  Purchase_Amount Purchase_Date  \
0                    5.0  Mombasa           629.59    2023-10-29
1                    5.0  Mombasa           424.31    2023-04-04
2                    3.0  Eldoret           220.66    2023-04-10
3                    0.0    Nyeri            13.95    2023-08-03
4                    5.0    Thika           666.85    2023-10-07
...                  ...      ...              ...           ...
1495                 1.0    Thika           436.37    2023-02-16
1496                 NaN  Malindi           650.64    2023-10-10
1497                 2.0  Garissa           145.98    2023-01-24
1498                 NaN   Nakuru              NaN    2023-07-19
1499                 3.0  Eldoret            46.88    2023-03-03

     Product_Category  Purchase_Frequency  Total_Spent  \
0          Automotive                   9      2981.75
1            Clothing                   2      1397.40
2           Furniture                   9      3769.70
3              Beauty                   2      2973.28
4         Electronics                   1       214.64
...               ...                 ...          ...
1495           Beauty                   3      4652.81
1496      Electronics                   9       891.92
1497      Electronics                   5      2048.69
1498       Automotive                   6      2359.37
1499             Toys                   4      2569.68

     Preferred_Payment_Method
0               Bank Transfer
1                 Credit Card
2                Mobile Money
3                Mobile Money
4                Mobile Money
...                       ...
1495            Bank Transfer
1496                     Cash
1497            Bank Transfer
1498                     Cash
1499             Mobile Money

[1500 rows x 13 columns]

### Display basic statistics and information about the dataset

In [164]:
df.describe()

,Customer_ID,Age,Number_of_Children,Purchase_Amount,Purchase_Date,Purchase_Frequency,Total_Spent
count,1500.000000,1466.000000,1429.00000,1471.000000,1419,1500.000000,1500.000000
mean,1750.500000,49.630286,2.96571,463.976540,2023-07-17 19:55:26.004228096,5.309333,2521.933413
min,1001.000000,18.000000,0.00000,-49.780000,2023-01-01 00:00:00,1.000000,100.420000
25%,1375.750000,34.000000,1.00000,206.645000,2023-04-05 12:00:00,3.000000,1280.882500
50%,1750.500000,50.500000,3.00000,453.710000,2023-07-21 00:00:00,5.000000,2515.110000
75%,2125.250000,65.000000,5.00000,724.490000,2023-10-24 12:00:00,8.000000,3767.222500
max,2500.000000,80.000000,6.00000,999.420000,2024-01-31 00:00:00,10.000000,4996.760000
std,433.157015,17.829217,2.02459,300.205729,NaN,2.899526,1424.549468

### Count missing values per column.

In [166]:
missing_values = df.isnull().sum()
missing_values

Customer_ID                  0
Name                        60
Age                         34
Gender                       0
Education_Level              0
Number_of_Children          71
City                        44
Purchase_Amount             29
Purchase_Date               81
Product_Category             0
Purchase_Frequency           0
Total_Spent                  0
Preferred_Payment_Method     0
dtype: int64

### Identify data types and any potential inconsistencies

In [168]:
df.dtypes
# age and number of children should be integers instead of float

Customer_ID                          int64
Name                                object
Age                                float64
Gender                              object
Education_Level                     object
Number_of_Children                 float64
City                                object
Purchase_Amount                    float64
Purchase_Date               datetime64[ns]
Product_Category                    object
Purchase_Frequency                   int64
Total_Spent                        float64
Preferred_Payment_Method            object
dtype: object

## Handling missing values

### Replace missing values in the Name column with "Unknown".

In [170]:
df["Name"].fillna("Unknown", inplace=True)  
print(df.head(15))

# confirming missing values have been replaced in Name column
missing_values = df.isnull().sum()
missing_values

    Customer_ID     Name   Age  Gender      Education_Level  \
0          1001    Alice  43.0    Male            Secondary
1          1002    David  66.0    Male              Diploma
2          1003      Bob  61.0    Male              Diploma
3          1004      Ian  37.0    Male            Secondary
4          1005    Grace  64.0  Female                  PhD
5          1006  Unknown  33.0  Female             Bachelor
6          1007    David  23.0    Male  No formal education
7          1008    Alice  25.0  Female              Diploma
8          1009      Ian  56.0    Male             Bachelor
9          1010   Hannah  60.0  Female            Secondary
10         1011    Alice  65.0  Female               Master
11         1012  Charlie  18.0    Male  No formal education
12         1013    Frank  62.0    Male            Secondary
13         1014    David   NaN  Female             Bachelor
14         1015    Frank  40.0    Male              Diploma

    Number_of_Children      City  Purchase_Amount Purchase_Date  \
0                  5.0   Mombasa           629.59    2023-10-29
1                  5.0   Mombasa           424.31    2023-04-04
2                  3.0   Eldoret           220.66    2023-04-10
3                  0.0     Nyeri            13.95    2023-08-03
4                  5.0     Thika           666.85    2023-10-07
5                  1.0    Nakuru           -48.18    2023-09-09
6                  NaN   Nairobi           -36.79    2023-12-18
7                  5.0   Malindi           271.58    2023-04-30
8                  6.0   Eldoret           546.48    2023-04-29
9                  4.0  Machakos            22.86    2023-10-04
10                 4.0  Machakos           618.31    2023-02-28
11                 5.0   Malindi           511.97    2023-04-01
12                 5.0   Nairobi            51.81    2023-06-13
13                 1.0   Mombasa           112.40    2023-06-23
14                 1.0   Nairobi           135.77    2024-01-20

   Product_Category  Purchase_Frequency  Total_Spent Preferred_Payment_Method
0        Automotive                   9      2981.75            Bank Transfer
1          Clothing                   2      1397.40              Credit Card
2         Furniture                   9      3769.70             Mobile Money
3            Beauty                   2      2973.28             Mobile Money
4       Electronics                   1       214.64             Mobile Money
5         Groceries                   5      3641.65            Bank Transfer
6       Electronics                   6      2577.76            Bank Transfer
7            Sports                   1      2776.04              Credit Card
8         Groceries                   3      1576.63                     Cash
9          Clothing                   5       113.67                     Cash
10           Beauty                   4      3766.10              Credit Card
11        Groceries                   8      4969.21            Bank Transfer
12             Toys                   4      3792.33              Credit Card
13       Automotive                   7      4247.79            Bank Transfer
14        Furniture                   2       206.33              Credit Card

C:\Users\USER\AppData\Local\Temp\ipykernel_2172\3254378596.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Name"].fillna("Unknown", inplace=True)

Customer_ID                  0
Name                         0
Age                         34
Gender                       0
Education_Level              0
Number_of_Children          71
City                        44
Purchase_Amount             29
Purchase_Date               81
Product_Category             0
Purchase_Frequency           0
Total_Spent                  0
Preferred_Payment_Method     0
dtype: int64

### Fill missing values in the Age column with the mean age of customers

In [172]:
df["Age"].fillna(df["Age"].mean(), inplace=True)
# confirming missing values have been replaced in Age column with mean of age
missing_values = df.isnull().sum()
missing_values

C:\Users\USER\AppData\Local\Temp\ipykernel_2172\275245698.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].mean(), inplace=True)

Customer_ID                  0
Name                         0
Age                          0
Gender                       0
Education_Level              0
Number_of_Children          71
City                        44
Purchase_Amount             29
Purchase_Date               81
Product_Category             0
Purchase_Frequency           0
Total_Spent                  0
Preferred_Payment_Method     0
dtype: int64

### Fill missing values in the Number_of_Children column with 0

In [174]:
df["Number_of_Children"].fillna(0, inplace=True)  

# confirming missing values have been replaced in Number_of_Children column with 0
missing_values = df.isnull().sum()
missing_values

C:\Users\USER\AppData\Local\Temp\ipykernel_2172\2921015594.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Number_of_Children"].fillna(0, inplace=True)

Customer_ID                  0
Name                         0
Age                          0
Gender                       0
Education_Level              0
Number_of_Children           0
City                        44
Purchase_Amount             29
Purchase_Date               81
Product_Category             0
Purchase_Frequency           0
Total_Spent                  0
Preferred_Payment_Method     0
dtype: int64

### Fill missing values in the City column with "Unknown".

In [177]:
df["City"].fillna("Unknown", inplace=True)
# confirming missing values have been replaced in City column with 0
missing_values = df.isnull().sum()
missing_values

C:\Users\USER\AppData\Local\Temp\ipykernel_2172\1645834736.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["City"].fillna("Unknown", inplace=True)

Customer_ID                  0
Name                         0
Age                          0
Gender                       0
Education_Level              0
Number_of_Children           0
City                         0
Purchase_Amount             29
Purchase_Date               81
Product_Category             0
Purchase_Frequency           0
Total_Spent                  0
Preferred_Payment_Method     0
dtype: int64

### If Purchase_Date is missing, replace it with "2023-01-01"

In [180]:
df["Purchase_Date"].fillna("2023-01-01", inplace=True)

# confirming missing values have been replaced in Purchase_Date column with 2023-01-01
missing_values = df.isnull().sum()
missing_values

C:\Users\USER\AppData\Local\Temp\ipykernel_2172\486610060.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Purchase_Date"].fillna("2023-01-01", inplace=True)

Customer_ID                  0
Name                         0
Age                          0
Gender                       0
Education_Level              0
Number_of_Children           0
City                         0
Purchase_Amount             29
Purchase_Date                0
Product_Category             0
Purchase_Frequency           0
Total_Spent                  0
Preferred_Payment_Method     0
dtype: int64

### If Purchase_Amount is missing, set it to 0.

In [183]:
df["Purchase_Amount"].fillna(0, inplace=True)

# confirming missing values have been replaced in Purchase_Amount column with 0
missing_values = df.isnull().sum()
missing_values

C:\Users\USER\AppData\Local\Temp\ipykernel_2172\3213597189.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Purchase_Amount"].fillna(0, inplace=True)

Customer_ID                 0
Name                        0
Age                         0
Gender                      0
Education_Level             0
Number_of_Children          0
City                        0
Purchase_Amount             0
Purchase_Date               0
Product_Category            0
Purchase_Frequency          0
Total_Spent                 0
Preferred_Payment_Method    0
dtype: int64

## Identify and Correct Invalid Data

### Some Purchase_Amount values are negative. Set all negative values to 0.

In [187]:
# identifying rows where Some Purchase_Amount values are negative
negative_values = df[df['Purchase_Amount'] < 0]
if not negative_values.empty:
    print("Negative values found:\n", negative_values)

Negative values found:
       Customer_ID     Name   Age  Gender      Education_Level  \
5            1006  Unknown  33.0  Female             Bachelor
6            1007    David  23.0    Male  No formal education
53           1054  Charlie  41.0    Male                  PhD
59           1060      Bob  64.0    Male            Secondary
64           1065      Eve  58.0    Male            Secondary
...           ...      ...   ...     ...                  ...
1389         2390    David  73.0  Female            Secondary
1422         2423    Frank  31.0    Male            Secondary
1432         2433  Unknown  52.0  Female               Master
1475         2476      Eve  20.0  Female             Bachelor
1478         2479    Alice  20.0  Female              Primary

      Number_of_Children      City  Purchase_Amount Purchase_Date  \
5                    1.0    Nakuru           -48.18    2023-09-09
6                    0.0   Nairobi           -36.79    2023-12-18
53                   0.0  Machakos           -20.64    2023-12-06
59                   6.0   Malindi            -3.04    2023-06-22
64                   5.0   Garissa            -2.50    2023-09-17
...                  ...       ...              ...           ...
1389                 1.0   Mombasa           -27.66    2023-07-09
1422                 2.0     Nyeri           -34.32    2023-09-11
1432                 5.0   Eldoret            -7.41    2023-05-13
1475                 0.0  Machakos           -38.83    2023-01-01
1478                 3.0  Machakos           -49.51    2023-06-26

     Product_Category  Purchase_Frequency  Total_Spent  \
5           Groceries                   5      3641.65
6         Electronics                   6      2577.76
53               Toys                  10      4497.56
59             Sports                   7      3506.20
64        Electronics                   1       894.79
...               ...                 ...          ...
1389           Sports                   2       116.90
1422            Books                   8      4043.77
1432       Automotive                   7      2911.02
1475             Toys                   2      4560.12
1478           Beauty                   2      4670.65

     Preferred_Payment_Method
5               Bank Transfer
6               Bank Transfer
53                       Cash
59                       Cash
64                       Cash
...                       ...
1389             Mobile Money
1422              Credit Card
1432             Mobile Money
1475                     Cash
1478              Credit Card

[78 rows x 13 columns]

In [189]:
# replacing with 0
replace=df.loc[df['Purchase_Amount'] < 0, 'Purchase_Amount'] = 0
print(replace)

0

In [211]:
#confirming values in Purchase_Amount  
p_confirmation=df[df["Purchase_Amount"]<0]
p_confirmation

Empty DataFrame
Columns: [Customer_ID, Name, Age, Gender, Education_Level, Number_of_Children, City, Purchase_Amount, Purchase_Date, Product_Category, Purchase_Frequency, Total_Spent, Preferred_Payment_Method]
Index: []

### Verify if there are any customers with age below 18 or above 80. If so, replace them with the median age.

In [203]:
age_range = df[(df['Age'] < 18) | (df['Age'] > 80)]
age_range
# there are no customers below age 18 and above age 80

Empty DataFrame
Columns: [Customer_ID, Name, Age, Gender, Education_Level, Number_of_Children, City, Purchase_Amount, Purchase_Date, Product_Category, Purchase_Frequency, Total_Spent, Preferred_Payment_Method]
Index: []

### Ensure that Purchase_Frequency is between 1 and 10. If outside this range, replace it with 5 (average frequency).

In [209]:
frequncy_range = df[(df['Purchase_Frequency'] > 1) | (df['Purchase_Frequency'] > 10)]
frequncy_range

,Customer_ID,Name,Age,Gender,Education_Level,Number_of_Children,City,Purchase_Amount,Purchase_Date,Product_Category,Purchase_Frequency,Total_Spent,Preferred_Payment_Method
0,1001,Alice,43.0,Male,Secondary,5.0,Mombasa,629.59,2023-10-29,Automotive,9,2981.75,Bank Transfer
1,1002,David,66.0,Male,Diploma,5.0,Mombasa,424.31,2023-04-04,Clothing,2,1397.40,Credit Card
2,1003,Bob,61.0,Male,Diploma,3.0,Eldoret,220.66,2023-04-10,Furniture,9,3769.70,Mobile Money
3,1004,Ian,37.0,Male,Secondary,0.0,Nyeri,13.95,2023-08-03,Beauty,2,2973.28,Mobile Money
5,1006,Unknown,33.0,Female,Bachelor,1.0,Nakuru,0.00,2023-09-09,Groceries,5,3641.65,Bank Transfer
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1495,2496,Ian,55.0,Male,Master,1.0,Thika,436.37,2023-02-16,Beauty,3,4652.81,Bank Transfer
1496,2497,Eve,75.0,Male,Master,0.0,Malindi,650.64,2023-10-10,Electronics,9,891.92,Cash
1497,2498,Bob,47.0,Male,Secondary,2.0,Garissa,145.98,2023-01-24,Electronics,5,2048.69,Bank Transfer
1498,2499,David,38.0,Male,Primary,0.0,Nakuru,0.00,2023-07-19,Automotive,6,2359.37,Cash
1499,2500,Charlie,76.0,Male,No formal education,3.0,Eldoret,46.88,2023-03-03,Toys,4,2569.68,Mobile Money